let str  = `# 基本信息 
求职意向:web前端  丨     意向城市:北京/深圳/上海

邮箱：dashsoap1997@gmail.com 电话 13051721616

院校专业：北京联合大学/计算机科学与技术 2019年本科毕业

Github:<https://github.com/Dashsoap> 博客：<https://dashsoap.com>

## 工作经历

北京嘉楠捷思科技有限公司丨软件工程师丨 2018.11-至今

作为软件工程师,参与了人工智能竞赛平台TensorRun,ToC端及其ToB端开发,企业内部Bug追踪管理系统,人员管理系统,的开发

除此之外,参与开发二代芯片kendryte K510芯片部分驱动开发

## 项目经历

企业项目 | **内部中型信息管理系统** | 2019.11-2020.6

基于**Vue Composition API** 的生产项目，主要技术栈还有TypeScript、ElementUI、axios等。
主要负责项目结构化，参与 prd 设计讨论，开发学生信息相关页面。
项目文件夹减少到4个，区分明确有效提高开发效率。
封装数据组件，利于重复利用，可在前端进行10w以下的数据排序。
主要负责staff端的开发，负责大部分页面
负责维护一个大表单页面，包括数据梳理和验证。

企业项目丨**BugTracker** 丨2019.4-2019.6

基于Vue全家桶的 问题反馈追踪平台 , 因为芯片设计领域 定位问题流程长,需要不同工程师负责

所以需要一个平台来追踪问题流程.

负责整个项目的构建与开发 克服了动态组件等问题 实现动态表单

企业项目 | **tensor.run 深度学习竞赛平台** | 2018.12-2019.3

基于 Vue 全家桶的单页应用，主要负责 PC 端部分页面的调优

负责并参与页面设计／接口设计／接口调优

编写了部分功能组件，例如：无线滚动轴／上传组件

项目一开始是后端工程师编写,逻辑问题,样式问题颇多，最后不畏艰难，按时上线.

企业项目 | **tensor.run-admin** | 2019.1-2019.6

利用开源项目 Vue-Element-admin UI 框架开发，与后端工程师深入交流

Api制定规范以及封装公用组件 例如：Axios/Uploader等等，编写业务界面等。

`
export default str