let str =`# 周靖添前端简历

求职意向:web 前端 丨 意向城市:北京 上海 深圳 ｜ 工作经验：2 年

邮箱：dashsoap1997@gmail.com 电话 13051721616

院校专业：北京联合大学/计算机科学与技术 2019 年本科毕业

Github:<https://github.com/Dashsoap> 博客：<https://dashsoap.com>

## 技能清单

- 熟悉 Vue.js 框架及其全家桶
- 熟练使用 git 版本控制工具，进行代码管理，实现敏捷开发；
- 熟练使用 Ajax，实现异步页面无刷新抽取数据，同步校验数据；
- 熟练使用 HTML5 和 CSS3，实现应用一站式跨屏（PC 端与移动端）开发；
- 熟练使用 HTML、CSS、JavaScript 等前端技术，完成网页静态布局，开发兼容主流浏览器的页面，以及实现页面的交互，提升用户体验；

## 工作经历

**中本聪明（北京）科技有限公司**丨 web 前端工程师丨 2020.9-至今

作为前端开发工程师，参与币印钱包/币印金融/火星计划的前端项目中，负责部分 web 端开发和 H5 开发，其中火星计划负责整个前端项目的 PC 端和 H5 端。

**北京嘉楠捷思信息技术有限公司**丨软件工程师丨 2018.11-2020.8

作为软件工程师，参与了人工智能竞赛平台 TensorRun，ToC 端及其 ToB 端开发，企业内部 Bug 追踪管理系统，人员管理系统的开发。

除此之外，参与开发二代芯片 kendryte K510 芯片部分驱动开发。

## 项目经历

企业项目 | **Mars 计划** | 2020.9-至今

项目是以太坊公链上的一款链上 App，使用的技术展主要有 **react web3 react-hooks styled-components**等等。
主要负责 PC/H5 双端编写与适配，推动前端 CI/CD 流程改进以及封装常用组建。
由于是第一次接触 react 项目，在简单的了解一下 react 之后，两个月之内交付了第一版，并且成功上线。锻炼了我的自学能力和抗压能力。

企业项目 | **币印钱包/币印金融** | 2020.9-至今

基于**Nuxt** 的生产项目，主要是针对公司的虚拟货币理财的购买与查看
主要的技术栈有**Vue | Nuxt | ProtoBuf** 等等
主要负责金融产品部分的编写与测试
封装通用的数据展示组件比如 TimeLine BreadCrumb 等等
主要负责页面的 H5 兼容，主要方法为媒体查询。

企业项目 | **内部中型信息管理系统** | 2019.11-2020.6

基于**Vue Composition API** 的生产项目，主要技术栈还有 TypeScript、ElementUI、axios 等。
主要负责项目结构化，参与 prd 设计讨论，开发学生信息相关页面。
项目文件夹减少到 4 个，区分明确有效提高开发效率。
封装数据组件，利于重复利用，可在前端进行 10w 以下的数据排序。
主要负责 staff 端的开发，负责大部分页面
负责维护一个大表单页面，包括数据梳理和验证。

企业项目丨**BugTracker** 丨 2019.4-2019.6

基于 Vue 全家桶的 问题反馈追踪平台 ， 因为芯片设计领域 定位问题流程长，需要不同工程师负责

所以需要一个平台来追踪问题流程.

负责整个项目的构建与开发 克服了动态组件等问题 实现动态表单

企业项目 | **tensor.run 深度学习竞赛平台** | 2018.12-2019.3

基于 Vue 全家桶的单页应用，主要负责 PC 端部分页面的调优

负责并参与页面设计／接口设计／接口调优

编写了部分功能组件，例如：无线滚动轴／上传组件

项目一开始是后端工程师编写，逻辑问题，样式问题颇多，最后不畏艰难，按时上线.

## 自我评价

以**Vue**框架为主的技术栈，并对其有一定的理解。

创业经历使我对产品有自己的见解。

具备团队合作精神，性格活泼外向，善于与人沟通，人品正直，有责任心，抗压能力强

工作和学习中善于总结，对新技术有强烈的好奇心

工作尽职尽责，乐于接受挑战性的工作

对金融与区块链行业比较熟悉。

---

## 致谢

感谢您花时间阅读我的简历，期待能有机会和您共事。

`
export default str